tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/fonts"

tap "ethereum/ethereum", "git@github.com:ethereum/homebrew-ethereum"
tap "homebrew/apache"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/x11"

tap "knqyf263/pet"

tap "pivotal/tap"

cask_args appdir: "/Applications"

brew "mpfr"
brew "arpack"
brew "aspell"
brew "autoconf"
brew "autoenv"
brew "automake"
brew "bison"
brew "boost"
brew "fontconfig"
brew "gettext"
brew "pixman"
brew "cask"
brew "certbot"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "curl"
brew "docker"
brew "docutils"
brew "elasticsearch", restart_service: true
brew "jpeg"
brew "elixir"
brew "little-cms2"
brew "ghostscript"
brew "epstool"
brew "fftw"
brew "fltk"
brew "fzf"
brew "fondu"
brew "gawk"
brew "gd"
brew "git"
brew "gl2ps"
brew "glpk"
brew "gnu-sed"
brew "lua"
brew "mysql", restart_service: true
brew "python3"
brew "postgresql", restart_service: true
brew "gnuplot", args: ["with-qt@5.7"]
brew "go"
brew "gobject-introspection"
brew "libtool"
brew "graphicsmagick"
brew "gsl"
brew "gstreamer"
brew "szip"
brew "hdf5"
brew "highlight"
brew "httpie"
brew "hugo"
brew "perl"
brew "pyenv"
brew "imagemagick"
brew "jsonpp"
brew "libgpg-error"
brew "libiconv"
brew "libksba"
brew "libyaml"
brew "mackup"
brew "macvim", args: ["with-override-system-vim"]
brew "makedepend"
brew "metis"
brew "mongodb", restart_service: true
brew "node"
brew "plotutils"
brew "qhull"
brew "octave"
brew "p7zip"
brew "pandoc"
brew "portmidi"
brew "pypy"
brew "qt"
brew "pyqt"
brew "qscintilla2"
brew "r"
brew "redis"
brew "ruby"
brew "sdl"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "sdl_image"
brew "sdl_mixer"
brew "sdl_ttf"
brew "texinfo"
brew "thefuck"
brew "tree"
brew "vim"
brew "wget"
brew "wiggle"
brew "zsh"
brew "ethereum/ethereum/ethereum"
brew "homebrew/apache/mod_wsgi"
brew "knqyf263/pet/pet"

cask "cuda"
cask "haskell-platform"

# Applications
## Development
cask "iterm2"
cask "pycharm"
cask "gogland"
cask "webstorm"
cask "clion"
cask "visual-studio-code"
cask "mysqlworkbench"
cask "rodeo"
cask "rstudio"
cask "postman"
cask "cyberduck"
cask "dash"
cask "virtualbox"
cask "google-cloud-sdk"

## Browsers
cask "google-chrome"
cask "firefox"

## Productivity
cask "google-backup-and-sync"
cask "evernote"
cask "alfred"
cask "dropbox"
cask "typora"
cask "marp"

## Utilities
cask "cyberduck"
cask "mathtype"
cask "tickeys"
cask "flux"
cask "tunnelblick"
cask "vlc"

## Apps
cask "slack"
cask "between"
cask "steam"